Repository: baqsia/PersonDirectory
Catalog: src/Task.PersonDirectory.Api/Resources/SharedResource.*.resx
Languages: ka

source: Person not found
ka: პერსონა ვერ მოიძებნა

source: City not found
ka: ქალაქი ვერ მოიძებნა

# RelationAdded
source: Relation has been added succesfully
ka: პიზიკური პირები დაკავშირდნენ წარმატებით

# RelationDropped
source: Relation has been dropped succesfully
ka: პიზიკური პირების კავშირი შეწყდა

source: Related person id must be greater than zero
ka: დაკავშირებული პირის ID ნულზე მეტი უნდა იყოს.

# PersonCantBeRelatedToThemselves
source: Person cannot be related to themselves
ka: პერსონას არ შეუძლია საკუთარ თავთან იყოს დაკავშირებული

source: First name is required
ka: სახელი სავალდებულოა

source: Last name is required
ka: გვარი სავალდებულოა

# FirstNameRange
source: First name must be between 2 and 50 characters
ka: სახელი უნდა შედგებოდეს 2-დან 50 სიმბოლომდე

# LastNameRange
source: Last name must be between 2 and 50 characters
ka: გვარი უნდა შედგებოდეს 2-დან 50 სიმბოლომდე

# FirstNameLettersValidation
source: First name must contain only Georgian or only Latin letters, not both
ka: სახელი უნდა შეიცავდეს მხოლოდ ქართულ ან მხოლოდ ლათინურ ასოებს და არა ორივეს ერთად

# LastNameLettersValidation
source: Last name must contain only Georgian or only Latin letters, not both
ka: გვარი უნდა შეიცავდეს მხოლოდ ქართულ ან მხოლოდ ლათინურ ასოებს და არა ორივეს ერთად

source: Gender is required
ka: სქესი სავალდებულოა

# GenderMustBeMaleOrFemale
source: Gender must be either 'male' or 'female'
ka: სქესი უნდა იყოს ან 'მამრობითი' ან 'მდედრობითი'

# CityIdMustBePositive
source: City ID must be a positive integer
ka: ქალაქის ID უნდა იყოს დადებითი მთელი რიცხვი

source: Date of birth is required
ka: დაბადების თარიღი სავალდებულოა

# MustBeAtLeast18
source: Person must be at least 18 years old
ka: პირი უნდა იყოს მინიმუმ 18 წლის

# PersonalNumberLength
source: Personal number must be exactly 11 digits
ka: პირადი ნომერი ზუსტად 11 ციფრისგან უნდა შედგებოდეს

# PersonalNumberIsRequired
source: Personal number must consist of digits only
ka: პირადი ნომერი მხოლოდ ციფრებისგან უნდა შედგებოდეს

# PersonalNumberDigitsOnly
source: Personal number is required
ka: პირადი ნომერი აუცილებელია

# PhoneNumberLengthRange
source: Phone number must be between 4 and 50 characters
ka: ტელეფონის ნომერი უნდა შედგებოდეს 4-დან 50 სიმბოლომდე

source: Phone number is required
ka: ტელეფონის ნომერი სავალდებულოა

# PhoneNumberTypeInvalid
source: Phone number type must be 'mobile', 'office', or 'home'
ka: ტელეფონის ნომრის ტიპი უნდა იყოს „მობილური“, „ოფისი“ ან „სახლი“

source: Phone number type is required
ka: ტელეფონის ნომრის ტიპი სავალდებულოა

source: File is empty
ka: ფაილი ცარიელია

# FileIsRequired
source: File must be provided
ka: ფაილი უნდა იყოს მოწოდებული

# ImageMinimumSize
source: Image must be less than 2MB
ka: სურათის ზომა 2 მბ-ზე ნაკლები უნდა იყოს

# ImageTypesAllowed
source: Only .jpg, .jpeg, or .png files are allowed
ka: დაშვებულია მხოლოდ .jpg, .jpeg ან .png ფაილები

# PageSizeMustBeBetween1to100
source: Page size must be between 1 and 100
ka: გვერდის ზომა უნდა იყოს 1-დან 100-მდე

# PageMustNotBeNegativeOrZero
source: Page number must be greater than 0
ka: გვერდის ნომერი 0-ზე მეტი უნდა იყოს

source: PersonId must be greater than zero
ka: პერსონის ID ნულზე მეტი უნდა იყოს.
